# -*- coding: utf-8 -*-
# @Time : 2021/02/09 16:32
# @Author : Lim Yoona
# @Site : 
# @File : 05_data_struct.py
# @Software: PyCharm

"""
    数据结构
"""
"""
    数据：是一个抽象概念，将其进行分类后得到程序设计语言中的基本类型
    数据结构：数据对象中元素之间的关系
    内置数据结构：不需要自己定义的数据结构，如列表，元组，字典
    扩展数据结构：没有直接定义，需要实现这些数据的组织方式
    
    算法和数据结构之间的区别：
        数据结构：只是静态描述数据元素之间的关系
        高效的程序需要在数据结构的基础上设计和选择算法
    
    程序 = 数据结构 + 算法
    
"""
"""
    抽象数据类型（Abstract Data Type）
        定义：一个数学模型以及定义在此数学模型基础上一组操作。（将数据结构和数据类型上的运算捆在一起，进行封装）
        目的：数据类型的表示和数据类型上的运算实现与数据类型和运算在程序中的引用隔开，是其独立
        
        常用数据操作：
            插入
            修改
            删除
            查找
            排序
"""


